---
kind: type
id: T:Autodesk.Revit.DB.ViewportRotation
source: html/517ccb28-82ff-c523-c372-d5d06daf1ff4.htm
---
# Autodesk.Revit.DB.ViewportRotation

Rotation of the viewport

## Syntax (C#)
```csharp
public enum ViewportRotation
```